/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Extensie Telesec";
"06 06 02 82 06 01 0A 01"		= "Mecanism Telesec";

"06 07 02 82 06 01 0A 01 00"	= "Autentificare Telesec";
"06 08 02 82 06 01 0A 01 00 01"	= "Autentificare parolă";
"06 08 02 82 06 01 0A 01 00 02" = "Autentificare parolă protejată";
"06 08 02 82 06 01 0A 01 00 03" = "Autentificare unidirecțională X.509";
"06 08 02 82 06 01 0A 01 00 04" = "Autentificare bidirecțională X.509";
"06 08 02 82 06 01 0A 01 00 05" = "Autentificare tridirecțională X.509";
"06 08 02 82 06 01 0A 01 00 06" = "Autentificare unidirecțională ISO9798";
"06 08 02 82 06 01 0A 01 00 07" = "Autentificare bidirecțională ISO9798";
"06 08 02 82 06 01 0A 01 00 08" = "Autentificare Telekom";

"06 07 02 82 06 01 0A 01 01"	= "Semnătură Telesec";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 cu RSA și ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 cu RSA și semnătură standard Telesec";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 cu RSA și ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 cu RSA și semnătură standard Telesec";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 cu RSA și semnătură standard Telekom";
"06 08 02 82 06 01 0A 01 01 09"	= "Semnătură HBCI RSA";

"06 07 02 82 06 01 0A 01 02"	= "Criptare Telesec";
"06 08 02 82 06 01 0A 01 02 00"	= "nimic";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Funcție unidirecțională";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Hash utilizând Block Cipher";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "Funcție FEC";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Modul Telesec";
"06 07 02 82 06 01 0A 02 00"	= "Algoritmi";
"06 07 02 82 06 01 0A 02 01"	= "Tipuri de atribut";
"06 07 02 82 06 01 0A 02 02"	= "Tipuri certificat";
"06 07 02 82 06 01 0A 02 03"	= "Tipuri mesaj";
"06 07 02 82 06 01 0A 02 04"	= "Protocol PL";
"06 07 02 82 06 01 0A 02 05"	= "SME și componenți ai SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Definiții utile";
"06 07 02 82 06 01 0A 02 08"	= "Fișiere STE";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Ordine electronică";
"06 07 02 82 06 01 0A 02 0B"	= "Aplicație asimetrică Telesec TTP";
"06 07 02 82 06 01 0A 02 0C"	= "Aplicație de bază Telesec TTP";
"06 07 02 82 06 01 0A 02 0D"	= "Mesaje Telesec TTP";
"06 07 02 82 06 01 0A 02 0E"	= "Timp aplicație ștampilă Telesec TTP";

"06 06 02 82 06 01 0A 03"		= "Clasă obiect";
"06 07 02 82 06 01 0A 03 00"	= "Alt nume Telesec";
"06 07 02 82 06 01 0A 03 01"	= "Director";
"06 07 02 82 06 01 0A 03 02"	= "Tip director";
"06 07 02 82 06 01 0A 03 03"	= "Grup directoare";
"06 07 02 82 06 01 0A 03 04"	= "Utilizator director";
"06 07 02 82 06 01 0A 03 05"	= "Introducere cheie simetrică";

"06 06 02 82 06 01 0A 04"		= "Pachet";
"06 06 02 82 06 01 0A 05"		= "Parametru";
"06 06 02 82 06 01 0A 06"		= "Legare nume";
"06 06 02 82 06 01 0A 07"		= "Atribut";
"06 07 02 82 06 01 0A 07 00"	= "Identificator grup aplicații";
"06 07 02 82 06 01 0A 07 01"	= "Tip certificat";
"06 07 02 82 06 01 0A 07 02"	= "Certificat Telesec";
"06 07 02 82 06 01 0A 07 03"	= "Număr certificat";
"06 07 02 82 06 01 0A 07 04"	= "Listă revocare certificat";
"06 07 02 82 06 01 0A 07 05"	= "Data creării";
"06 07 02 82 06 01 0A 07 06"	= "Emitent";
"06 07 02 82 06 01 0A 07 07"	= "Autoritate de denumire";
"06 07 02 82 06 01 0A 07 08"	= "Director de cheie publică";
"06 07 02 82 06 01 0A 07 09"	= "Domeniu securitate";
"06 07 02 82 06 01 0A 07 0A"	= "Subiect";
"06 07 02 82 06 01 0A 07 0B"	= "Timpul revocării";
"06 07 02 82 06 01 0A 07 0C"	= "Referință grup utilizator";
"06 07 02 82 06 01 0A 07 0D"	= "Validitate";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Mediu mesaj securitate";
"06 07 02 82 06 01 0A 07 10"	= "Director de cheie publică anonimă";
"06 07 02 82 06 01 0A 07 11"	= "Prenume Telesec";
"06 07 02 82 06 01 0A 07 12"	= "Adăugări nume";
"06 07 02 82 06 01 0A 07 13"	= "Cod poștal Telesec";
"06 07 02 82 06 01 0A 07 14"	= "Diferențiator de nume";
"06 07 02 82 06 01 0A 07 15"	= "Listă certificat Telesec";
"06 07 02 82 06 01 0A 07 16"	= "Listă certificat Teletrust";
"06 07 02 82 06 01 0A 07 17"	= "Listă certificat X.509";
"06 07 02 82 06 01 0A 07 18"	= "Timpul emiterii";
"06 07 02 82 06 01 0A 07 19"	= "Număr de cartelă fizică";
"06 07 02 82 06 01 0A 07 1A"	= "Tip fișier";
"06 07 02 82 06 01 0A 07 1B"	= "Fișierul Ctl este arhivă";
"06 07 02 82 06 01 0A 07 1C"	= "Adresă e-mail";
"06 07 02 82 06 01 0A 07 1D"	= "Listă modele certificat";
"06 07 02 82 06 01 0A 07 1E"	= "Nume director";
"06 07 02 82 06 01 0A 07 1F"	= "Nume tip director";
"06 07 02 82 06 01 0A 07 20"	= "Nume grup directoare";
"06 07 02 82 06 01 0A 07 21"	= "Nume de utilizator director";
"06 07 02 82 06 01 0A 07 22"	= "Revocare marcare";
"06 07 02 82 06 01 0A 07 23"	= "Nume introducere cheie simetrică";
"06 07 02 82 06 01 0A 07 24"	= "Număr GL";
"06 07 02 82 06 01 0A 07 25"	= "Număr GO";
"06 07 02 82 06 01 0A 07 26"	= "Date cheie G";
"06 07 02 82 06 01 0A 07 27"	= "Date cheie Z";
"06 07 02 82 06 01 0A 07 28"	= "Date cheie KT";
"06 07 02 82 06 01 0A 07 2A"	= "Număr cheie KT";
"06 07 02 82 06 01 0A 07 33"	= "Timpul generării revocării";
"06 07 02 82 06 01 0A 07 34"	= "Text responsabilitate";

"06 06 02 82 06 01 0A 08"		= "Grup de atribute";
"06 06 02 82 06 01 0A 09"		= "Acțiune";
"06 06 02 82 06 01 0A 0A"		= "Notificare";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Aplicație securitate";

"06 06 02 82 06 01 0A 0C"		= "Definiții certificat și extensii CRL";

"06 07 02 82 06 01 0A 0C 00"	= "limitare de extensie de responsabilitate certificat de extensie";
"06 07 02 82 06 01 0A 0C 01"	= "Extensie identificare certificat Telesec";
"06 07 02 82 06 01 0A 0C 02"	= "Identificator de regulă Telesec";
"06 07 02 82 06 01 0A 0C 03"	= "Identificare calificator de regulă Telesec";
"06 07 02 82 06 01 0A 0C 04"	= "Extensie filtrată Telesec CRL ";
"06 07 02 82 06 01 0A 0C 05"	= "Extensie filtru Telesec CRL ";
"06 07 02 82 06 01 0A 0C 06"	= "Extensie autoritate de numire Telesec";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "Identificare utilizator";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "Cutie poștală RFC822";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Component domeniu";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Număr de business Australia";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Identificator regulă certificate Australia";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Ștampilă Personal";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Ștampilă Business";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Ștampilă Legal";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Ștampilă Pilot";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Ștampilă IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Ștampilă identificator de regulă";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Algoritm criptare simetrică";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "Identificator regulă de asigurare superioară SEIS";
"06 06 2A 85 70 22 01 02"	= "Identificator de regulă SEIS GAK";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "Identificator personal SEIS AT";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "Modul ANSI X9.57";
"06 07 2A 86 48 CE 38 01 01"	= "Certificat management X9F1 ";
"06 06 2A 86 48 CE 38 02"		= "Reținere instrucție";
"06 07 2A 86 48 CE 38 02 01"	= "Reținere instrucție - nimic";
"06 07 2A 86 48 CE 38 02 02"	= "Emitent apel";
"06 07 2A 86 48 CE 38 02 03"	= "Respingere";
"06 07 2A 86 48 CE 38 02 04"	= "Token culegere";
"06 06 2A 86 48 CE 38 03"		= "Atribut";
"06 06 2A 86 48 CE 38 03 01"	= "Contrasemnătură";
"06 06 2A 86 48 CE 38 03 02"	= "Certificat de atribut";
"06 06 2A 86 48 CE 38 04"		= "Algoritm";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "Corespunde DSA";
"06 07 2A 86 48 CE 38 04 03"	= "DSA cu SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "Tip de câmp ANSI X9.62";
"06 07 2A 86 48 CE 3D 01 01"	= "Câmp prim";
"06 07 2A 86 48 CE 3D 01 02"	= "Câmp caracteristica doi";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Bază caracteristica doi";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Bază nulă";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Bază trinomică";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Bază pentanomică";
"06 06 2A 86 48 CE 3D 02"		= "Tip cheie publică";
"06 07 2A 86 48 CE 3D 02 01"	= "Cheie publică curbă eliptică";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "Tip de câmp ANSI X9.42";
"06 07 2A 86 48 CE 3E 01 01"	= "Prim câmp Galois";
"06 06 2A 86 48 CE 3E 02"		= "Tip de număr";
"06 07 2A 86 48 CE 3E 02 01"	= "Cheie publică Diffie-Hellman";
"06 06 2A 86 48 CE 3E 03"		= "Plan";
"06 07 2A 86 48 CE 3E 03 01"	= "Static Diffie-Hellman";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman efemer";
"06 07 2A 86 48 CE 3E 03 03"	= "Hibrid 1 Diffie-Hellman";
"06 07 2A 86 48 CE 3E 03 04"	= "Hibrid 2 Diffie-Hellman";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Încredințare informații versiune";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE cu MD5 și CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "MAC bazat pe parolă";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Încredințare utilizator";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Informații CA Entrust";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Certificat de atribut";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "Criptare RSA";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 cu criptare RSA";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 cu criptare RSA";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 cu criptare RSA";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 cu criptare RSA";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "Criptare RSA-OAEP (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "Criptare RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "Etichetă specificată RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "Plan de semnătură RSA-PSS";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 cu criptare RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 cu criptare RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 cu criptare RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 cu criptare RSA";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "Criptare BSAFE RSA";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Acord cheie Diffie-Hellman";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE cu MD2 și DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE cu MD5 și DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE cu MD2 și RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE cu MD5 și RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE cu MD5 și XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE cu SHA și DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Date";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Date semnate";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Date învăluite";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Date semnate și învăluite";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Date rezumate";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Date criptate";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Date cu atribute";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Informații cheie privată criptată";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "Adresă e-mail";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Nume nestructurat";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Tip conținut";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Rezumat mesaj";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Timp semnare";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Contrasemnătură";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Parolă dificultate";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Adresă nestructurată";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Atribute certificat extinse";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Emitent și număr serial";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Verificare parolă";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Cheie publică";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Descriere semnare";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Solicitare extensie";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "Capabilități S/MIME";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Se preferă date semnate";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Imposibil de decriptat";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Solicitare recepționare";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Recepționare";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Aluzii conținut";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Istoric expansiune listă e-mail";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "Module S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Sintaxă mesaj criptografic";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Servicii de securitate intensificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "Identificator obiecte S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "Mesaj S/MIME V3";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "Semnătură electronică 88 ETS";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "Semnătură electronică 97 ETS";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "Regulă de semnătură electronică 88 ETS";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "Regulă de semnătură electronică 97 ETS";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "Tipuri conținut S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "Atribute autentificate S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "Algoritmi S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "Distribuire certificat S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "Distribuție certificat LDAP";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "Calificator semnătură regulă S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "Identificator tip semnătură S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Semnătură inițiator";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Semnătură domeniu";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Semnătură atribute suplimentare";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Revizuire semnătură";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "Capabilități S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Se preferă interior binar";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Nume amical  (pentru PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "Identificare cheie locală (pentru PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Tipuri certificat (pentru PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "Certificat X.509 (pentru PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "Certificat SDSI (pentru PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "Tipuri CRL (pentru PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509 CRL (pentru PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "Sintaxă schimb de informații personale PKCS-12";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "Identificări criptare pe bază de parolă PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE cu SHA-1 și RC4 de 128 biți";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE cu SHA-1 și RC4 de 40 biți";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE cu SHA-1 și 3 taste de DES-CBC triple";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE cu SHA-1 și 2 taste de DES-CBC triple";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE cu SHA-1 și RC2-CBC de 128 biți";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE cu SHA-1 și RC2-CBC de 40 biți";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "Identificări ESPVK PKCS-12 ";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "Învăluire cheie PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "PKCS-12 identificări Bag ";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "Bag identificare PKCS-12 ";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "Certificat PKCS-12 și identificare Bag CRL";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "Identificare Bag secret PKCS-12 ";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "Identificare cu conținut securizat PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "Identificare Bag cheie învăluit PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "Identificare certificat Bag PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "Certificat X.509 PKCS-12 și identificare Bag CRL";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "Identificare certificat Bag PKCS-12 SDSI";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "Identificare criptare pe bază de parolă PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE cu SHA-1 și RC4 de 128 biți";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE cu SHA-1 și RC4 de 40 biți";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE cu SHA-1 și DES-CBC triple";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE cu SHA-1 și RC2-CBC de 128 biți";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE cu SHA-1 și RC2-CBC de 40 biți";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE cu SHA-1 și RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE cu SHA-1 și RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "Identificări învăluitoare PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "Criptare RSA cu RC4 de 128 biți PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "Criptare RSA cu RC4 de 40 biți PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "Criptare RSA cu DES triple PKCS-12";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "Identificare semnătură PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "Semnătură RSA cu rezumat SHA-1 PKCS-12";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 Versiunea 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "Identificări Bag PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "Bag cheie PKCS-12 ";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "Bag cheie învăluit PKCS-12 PKCS-8";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "Certificat Bag PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "Bag CRL PKCS-12 ";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "Bag secret PKCS-12 ";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "Bag cu conținut securizat PKCS-12";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "Module PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "Atribute PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "Tip conținut PKCS-15";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "Conținut PKCS-15";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "Algoritm rezumat RSADSI";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC cu SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "Algoritm criptare RSADSI";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 cu MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "Taste RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Identificator regulă necunoscut Identrus";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos v5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "Inter-utilizator MIT Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Clasă obiecte server Microsoft Exchange";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Adresare site";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Plan clasă";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Plan de atribut";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Agent cutie poștală";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Cutie poștală";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Container";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Destinatar e-mail";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Mecanism livrare";

"06 07 2A 86 48 86 F7 14 04"				= "Formaturi fișiere Microsoft";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Word";

"06 08 2B 06 01 04 01 82 37 02"				= "Autenticod";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "Context date indirecte SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "Informații agenție SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "Tip declarație SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "Informații SPC Opus";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "Extensii certificat SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "Date imagine SPC PE";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "Link SPC (tip 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Semnare cod individual";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Semnare cod comercial";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "Link SPC (tip 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "Criterii minime SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "Criterii financiare SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "Link SPC (tip 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "Furnizor de asistență securitate NTLM";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Contrasemnătură ștampilă timp";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Listă încredere certificat";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Extensie CTL sortată";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Următorul loc de actualizare";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Utilizare cheie intensificată";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Semnare listă încredere certificat";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Semnare ștampilă timp";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Crypto cu poartă server";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Criptare serializată";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Sisteme de fișier criptate";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Recuperare de sisteme de fișier criptate";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Compatibil cu hardware Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "Semnare NT5";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Semnare hardware Windows OEM";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Semnare NT inclusă";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Semnare listă rădăcini de încredere";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Subordonare calificată";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Recuperare cheie";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Semnare document";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Atribut identificatori de obiecte";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Atribut de încredere Da/Nu";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Muzică DRM Microsoft ";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Individualizare Microsoft DRM";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Licențe Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Server licență Microsoft";

"06 08 2B 06 01 04 01 82 37 0D"				= "Identificatori obiecte Microsoft PKCS-10 ";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Certificat reînnoire";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Înscriere asociere Nume/Valoare";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "CSP înscriere";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "Versiune OS";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook Express";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Atribute Microsoft PKCS-12";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Set de chei pentru aparat local";

"06 08 2B 06 01 04 01 82 37 14"				= "Infrastructură înscriere Microsoft";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Utilizare auto-înscriere CTL";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Tip de certificat de înscriere";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Agent înscriere";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Conectare Smartcard";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "Nume principal NT";

"06 08 2B 06 01 04 01 82 37 15"				= "Certificat infrastructură server Microsoft";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Versiune de reînnoire Microsoft CA";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "Versiune CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 02"			= "Atribut CAPICOM";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Nume document";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Descriere document";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Date criptate";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Conținut criptat";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "Identificator de regulă UNINETT";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "Identificator regulă ICE-TEL";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "Identificator regulă ICE-TEL CA";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal cu SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal cu RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "Atribute cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "Verificare prezență cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "RTCS răspuns OCSP";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "RTCS răspuns OCSP extins";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "Motiv extins CRL";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Caracteristici cheie";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "Pornire PKI";
"06 09 2B 06 01 04 01 97 55 04 01"			= "Conținut cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "Date de configurare cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "Index utilizator cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "Informații utilizator cryptlib";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "Identificator de regulă XYZZY";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Durabil";
"06 08 2B 06 01 04 01 AA 60 01"		= "Sistem semnătură timp";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Sistem semnătură timp 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Sistem semnătură timp 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Sistem semnătură timp 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Practici secundare";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Identificatori medici";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "PKINIT Kerberos";
"06 07 2B 06 01 05 02 03 01"        = "Date de autentificare Kerberos";
"06 07 2B 06 01 05 02 03 02"        = "Date cheie Kerberos Diffie-Hellman";
"06 07 2B 06 01 05 02 03 03"        = "Date cheie răspuns Kerberos";
"06 07 2B 06 01 05 02 03 04"        = "Autentificare client Kerberos";
"06 07 2B 06 01 05 02 03 05"        = "Centrul de distribuție cheie Kerberos (DCK)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "Mecanism de cheie publică simplă (MCPS)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Infrastructură cheie publică";

"06 07 2B 06 01 05 05 07 01"		= "Extensii certificat privat PKIX";
"06 08 2B 06 01 05 05 07 01 01"		= "Acces informații autoritate certificat";
"06 08 2B 06 01 05 05 07 01 02"		= "Informații biometrice";
"06 08 2B 06 01 05 05 07 01 03"		= "Declarații certificat calificate";
"06 08 2B 06 01 05 05 07 01 04"		= "Certificat de atribut identitate revizie";
"06 08 2B 06 01 05 05 07 01 05"		= "Certificat de atribut țintire";
"06 08 2B 06 01 05 05 07 01 06"		= "Certificat de atribut controale autoritate";
"06 08 2B 06 01 05 05 07 01 07"		= "Bloc adrese SBGP IP ";
"06 08 2B 06 01 05 05 07 01 08"		= "Identificator sistem autonom SBGP";
"06 08 2B 06 01 05 05 07 01 09"		= "Identificator ruter SBGP";
"06 08 2B 06 01 05 05 07 01 0A"		= "Certificat de atribut proxy";
"06 08 2B 06 01 05 05 07 01 0B"		= "Acces informații subiect";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotip";

"06 07 2B 06 01 05 05 07 02"		= "Tipuri calificatori regulă";
"06 08 2B 06 01 05 05 07 02 01"		= "Declarație de practică de certificare";
"06 08 2B 06 01 05 05 07 02 02"		= "Notificare utilizator";
"06 08 2B 06 01 05 05 07 02 03"		= "Notificare text";

"06 07 2B 06 01 05 05 07 03"		= "Scop cheie";
"06 08 2B 06 01 05 05 07 03 01"		= "Autentificare server";
"06 08 2B 06 01 05 05 07 03 02"		= "Autentificare client";
"06 08 2B 06 01 05 05 07 03 03"		= "Semnare cod";
"06 08 2B 06 01 05 05 07 03 04"		= "Protecție e-mail";
"06 08 2B 06 01 05 05 07 03 05"		= "Sfârșit sistem IPSEC";
"06 08 2B 06 01 05 05 07 03 06"		= "Tunel IPSEC";
"06 08 2B 06 01 05 05 07 03 07"		= "Utilizator IPSEC";
"06 08 2B 06 01 05 05 07 03 08"		= "Ștampilare timp";
"06 08 2B 06 01 05 05 07 03 09"		= "Semnare OCSP";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "Autentificare server SBGP AA";

"06 07 2B 06 01 05 05 07 04"		= "Tipuri de informații CMP";
"06 08 2B 06 01 05 05 07 04 01"		= "Certificat de protocol criptare CA";
"06 08 2B 06 01 05 05 07 04 02"		= "Semnare tipuri de chei asociate";
"06 08 2B 06 01 05 05 07 04 03"		= "Criptare de tipuri de chei asociate";
"06 08 2B 06 01 05 05 07 04 04"		= "Algoritm simetric preferabil";
"06 08 2B 06 01 05 05 07 04 05"		= "Informații actualizare cheie CA";
"06 08 2B 06 01 05 05 07 04 06"		= "CRL actual";
"06 08 2B 06 01 05 05 07 04 07"		= "OID-uri neadmise";
"06 08 2B 06 01 05 05 07 04 08"		= "Solicitare abonament";
"06 08 2B 06 01 05 05 07 04 09"		= "Răspuns abonament";
"06 08 2B 06 01 05 05 07 04 0A"		= "Solicitare parametru chei asociate";
"06 08 2B 06 01 05 05 07 04 0B"		= "Răspuns parametru chei asociate";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "Înregistrare CRMF";
"06 08 2B 06 01 05 05 07 05 01"		= "Control înregistrare";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Token înregistrare";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Autentificator";
"06 09 2B 06 01 05 05 07 05 01 03"	= "Informații publicare PKI";
"06 09 2B 06 01 05 05 07 05 01 04"	= "Opțiuni arhivă PKI";
"06 09 2B 06 01 05 05 07 05 01 05"	= "Identificare certificat veche";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Cheie de criptare protocol";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Model certificat alternativ";
"06 09 2B 06 01 05 05 07 05 01 08"	= "Model WAP WTLS";

"06 08 2B 06 01 05 05 07 05 02"		= "Informații înregistrare CRMF";
"06 09 2B 06 01 05 05 07 05 02 01"	= "Asocieri UTF-8";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Solicitare certificat";

"06 07 2B 06 01 05 05 07 06"		= "Algoritmi";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Nicio semnătură";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "Controale CMC";

"06 07 2B 06 01 05 05 07 08"		= "Alte nume";
"06 08 2B 06 01 05 05 07 08 01"		= "Date personale";
"06 08 2B 06 01 05 05 07 08 02"		= "Grup utilizator";

"06 07 2B 06 01 05 05 07 09"		= "Date personale";
"06 08 2B 06 01 05 05 07 09 01"		= "Dată de naștere";
"06 08 2B 06 01 05 05 07 09 02"		= "Loc de naștere";
"06 08 2B 06 01 05 05 07 09 03"		= "Pseudonim";
"06 08 2B 06 01 05 05 07 09 04"		= "Sex";
"06 08 2B 06 01 05 05 07 09 05"		= "Țara de cetățenie";
"06 08 2B 06 01 05 05 07 09 06"		= "Țara de reședință";

"06 07 2B 06 01 05 05 07 0A"		= "Certificat de atribut";
"06 08 2B 06 01 05 05 07 0A 01"		= "Informații de autentificare";
"06 08 2B 06 01 05 05 07 0A 02"		= "Acces identitate";
"06 08 2B 06 01 05 05 07 0A 03"		= "Încărcare identitate";
"06 08 2B 06 01 05 05 07 0A 04"		= "Grup";
"06 08 2B 06 01 05 05 07 0A 05"		= "Rol";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Protocol stare certificat online";
"06 09 2B 06 01 05 05 07 30 01 01"	= "Răspuns de bază OCSP";
"06 09 2B 06 01 05 05 07 30 01 02"	= "Extensie OCSP Nonce";
"06 09 2B 06 01 05 05 07 30 01 03"	= "Referință OCSP CRL";
"06 09 2B 06 01 05 05 07 30 01 04"	= "Răspuns OCSP";
"06 09 2B 06 01 05 05 07 30 01 05"	= "Nicio verificare de revocare OCSP";
"06 09 2B 06 01 05 05 07 30 01 06"	= "Tăiere arhivă OCSP";
"06 09 2B 06 01 05 05 07 30 01 07"	= "Locator serviciu OCSP";

"06 08 2B 06 01 05 05 07 30 02"		= "Emitenți CA";
"06 08 2B 06 01 05 05 07 30 03"		= "Ștampilare timp";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "Intermediar IKE";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "Algoritm criptare DEC";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "Algoritm Hash DEC";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 03"		= "Algoritm semnătură DEC";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 cu RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 cu RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 cu RSA";
"06 05 2B 0E 03 02 03"				= "MD5 cu RSA";
"06 05 2B 0E 03 02 04"				= "MD4 cu criptare RSA";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N cu RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "Semnătură RSA";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA cu SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 cu semnătură RSA";
"06 05 2B 0E 03 02 0F"				= "SHA cu semnătură RSA";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman cu coeficient comun";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA comun";
"06 05 2B 0E 03 02 15"				= "DSA comun cu SHA";
"06 05 2B 0E 03 02 16"				= "Transport cheie RSA";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 cu semnătură RSA";
"06 05 2B 0E 03 02 19"				= "MD5 cu semnătură RSA";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA cu SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA cu SHA-1 comun";
"06 05 2B 0E 03 02 1D"				= "SHA-1 cu criptare RSA";
"06 05 2B 0E 03 03 01"				= "Mecanism-autentificare-puternic-simplu";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 cu RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 cu ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Document";
"06 04 2B 24 01 01"					= "Versiune finală";
"06 04 2B 24 01 02"					= "Ciornă";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Algoritm";
"06 04 2B 24 03 01"					= "Algoritm criptare";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "Taste DES-ECB";
"06 07 2B 24 03 01 01 01 01"		= "Taste DES-ECB ISO";
"06 07 2B 24 03 01 01 02 01"		= "Taste DES-CBC";
"06 08 2B 24 03 01 01 02 01 01"		= "Taste DES-CBC ISO";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "Taste DES3-ECB";
"06 08 2B 24 03 01 03 01 01 01"		= "Taste DES3-ECB ISO";
"06 07 2B 24 03 01 03 02 01"		= "Taste DES3-CBC";
"06 08 2B 24 03 01 03 02 01 01"		= "Taste DES3-CBC ISO";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "Taste IDEA-ECB";
"06 08 2B 24 03 01 02 01 01 01"		= "Taste IDEA-ECB ISO";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "Taste IDEA-CBC";
"06 08 2B 24 03 01 02 02 01 01"		= "Taste IDEA-CBC ISO";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "Criptare RSA";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "Taste BSI-1-ECB";
"06 06 2B 24 03 01 05 02"			= "Taste BSI-1-CBC";
"06 07 2B 24 03 01 05 02 01"		= "Taste BSI-1-CBC PEM";

"06 04 2B 24 03 02"					= "Algoritm Hash";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "Lungime unică MDC2";
"06 05 2B 24 03 02 05"				= "Lungime dublă MDC2";
"06 04 2B 24 03 03"					= "Algoritm semnătură";
"06 05 2B 24 03 03 01"				= "Semnătură RSA";

"06 06 2B 24 03 03 01 01"			= "Semnătură RSA cu SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "Semnătură RSA cu SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "Semnătură RSA cu SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "Semnătură RSA cu SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "Semnătură RSA cu SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "Semnătură RSA cu SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "Semnătură RSA cu SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "Semnătură RSA cu SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "Semnătură RSA cu SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "Semnătură RSA cu SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "Semnătură RSA cu SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "Semnătură RSA cu SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "Semnătură RSA cu SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "Semnătură RSA cu SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "Semnătură RSA cu SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "Semnătură RSA cu SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "Semnătură RSA cu SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "Semnătură RSA cu SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "Semnătură RSA cu SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "Semnătură RSA cu SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "Semnătură RSA cu SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "Semnătură RSA cu SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "Semnătură RSA cu SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "Semnătură RSA cu SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "Semnătură RSA cu SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "Semnătură RSA cu SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "Semnătură RSA cu RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "Semnătură RSA cu RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "Semnătură RSA cu RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "Semnătură RSA cu RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "Semnătură RSA cu RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "Semnătură RSA cu RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "Semnătură RSA cu RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "Semnătură RSA cu RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "Semnătură RSA cu RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "Semnătură RSA cu RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "Semnătură RSA cu RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "Semnătură RSA cu RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "Semnătură RSA cu RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "Semnătură RSA cu RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "Semnătură RSA cu RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "Semnătură RSA cu RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "Semnătură RSA cu RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "Semnătură RSA cu RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "Semnătură RSA cu RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "Semnătură RSA cu RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "Semnătură RSA cu RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "Semnătură RSA cu RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "Semnătură RSA cu RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "Semnătură RSA cu RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "Semnătură RSA cu RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "Semnătură RSA cu RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "Semnătură RSA cu RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "Semnătură RSA cu RIPEMD-256";

"06 05 2B 24 03 03 02"				= "Semnătură ECSIE";
"06 06 2B 24 03 03 02 01"			= "Semnătură ECSIE cu SHA-1";
"06 06 2B 24 03 03 02 02"			= "Semnătură ECSIE cu RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "Semnătură ECSIE cu MD2";
"06 06 2B 24 03 03 02 04"			= "Semnătură ECSIE cu MD5";

"06 04 2B 24 03 04"					= "Plan semnătură";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 cu RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 cu RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 cu RND";

"06 03 2B 24 04"					= "Atribut";
"06 03 2B 24 05"					= "Regulă";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "API de fabricant specific";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "API cu funcționalitate specifică";
"06 03 2B 24 07"					= "Management cheie";
"06 04 2B 24 07 01"					= "Acord cheie";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Transfer cheie";
"06 05 2B 24 07 02 01"				= "ISO9796-2 cu criptare RSA";

"06 05 2B 24 08 01 01"				= "Identificator regulă Teletrust SigiSigConform";
"06 05 2B 24 08 02 01"				= "Serviciu director";

"06 05 2B 24 08 03 01"				= "Data generării certificatului";
"06 05 2B 24 08 03 02"				= "Procurare";
"06 05 2B 24 08 03 03"				= "Admitere";
"06 05 2B 24 08 03 04"				= "Limită monetară";
"06 05 2B 24 08 03 05"				= "Declarație de majoritate";
"06 05 2B 24 08 03 06"				= "Număr serial al cartelei cu circuit integrat";
"06 05 2B 24 08 03 07"				= "Referință cheie publică";
"06 05 2B 24 08 03 08"				= "Restricție";
"06 05 2B 24 08 03 09"				= "Accesare cu permisiune";
"06 05 2B 24 08 03 0A"				= "Certificat solicitat";
"06 05 2B 24 08 03 0B"				= "Autorități de denumire";
"06 05 2B 24 08 03 0C"				= "Certificat în director de la data de";
"06 05 2B 24 08 03 0D"				= " Hash certificat";

"06 05 2B 24 08 04 01"				= "Date personale";
"06 05 2B 24 08 04 08"				= "Restricție";
"06 07 2B 24 08 05 01 01 01"		= "RSA indicare SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA indicare RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA cu SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA cu RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA extins";
"06 07 2B 24 08 05 01 02 02"		= "DSA cu RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Certificat";
"06 05 2B 24 08 06 02"				= "Referință certificat";
"06 05 2B 24 08 06 03"				= "Certificat de atribut";
"06 05 2B 24 08 06 04"				= "Referință de atribut";
"06 05 2B 24 08 06 05"				= "Nume fișier";
"06 05 2B 24 08 06 06"				= "Timp stocare";
"06 05 2B 24 08 06 07"				= "Dimensiune fișier";
"06 05 2B 24 08 06 08"				= "Loc";
"06 05 2B 24 08 06 09"				= "Număr semnătură";
"06 05 2B 24 08 06 0A"				= "Auto-generat";

"06 05 2B 24 08 07 01"				= "Tipuri prezentare Teletrust";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Binar";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Tragere";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Text";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Extensie certificat Thawte";
"06 05 2B 65 01 04 01"				= "Extranet puternic";

/* X.520 */

"06 02 55 04"		= "Tipuri de atribut X.520";
"06 03 55 04 00"	= "Clasă obiect";
"06 03 55 04 01"	= "Nume alias introducere";
"06 03 55 04 02"	= "Informații cunoștințe";
"06 03 55 04 03"	= "Nume comun";
"06 03 55 04 04"	= "Nume de familie";
"06 03 55 04 05"	= "Număr serial";
"06 03 55 04 06"	= "Nume țară";
"06 03 55 04 07"	= "Nume de localitate";
"06 04 55 04 07 01"	= "Nume colectiv localitate";
"06 03 55 04 08"	= "Nume de stat sau regiune";
"06 04 55 04 08 01"	= "Nume colectiv de stat sau regiune";
"06 03 55 04 09"	= "Adresă geografică";
"06 04 55 04 09 01"	= "Adresă geografică colectivă";
"06 03 55 04 0A"	= "Nume organizație";
"06 04 55 04 0A 01"	= "Nume colectiv organizație";
"06 03 55 04 0B"	= "Nume unitate organizatorică";
"06 04 55 04 0B 01"	= "Nume colectiv unitate organizatorică";
"06 03 55 04 0C"	= "Titlu";
"06 03 55 04 0D"	= "Descriere";
"06 03 55 04 0E"	= "Ghid căutare";
"06 03 55 04 0F"	= "Categorie business";
"06 03 55 04 10"	= "Adresă poștală";
"06 04 55 04 10 01"	= "Adresă poștală colectivă";
"06 03 55 04 11"	= "Cod poștal";
"06 04 55 04 11 01"	= "Cod poștal colectiv";
"06 03 55 04 12"	= "Căsuță poștală";
"06 04 55 04 12 01"	= "Căsuță poștală colectivă";
"06 03 55 04 13"	= "Nume birou de livrare fizică";
"06 04 55 04 13 01"	= "Nume colectiv birou de livrare fizică";
"06 03 55 04 14"	= "Număr de telefon";
"06 04 55 04 14 01"	= "Număr colectiv telefon";
"06 03 55 04 15"	= "Număr de telex";
"06 04 55 04 15 01"	= "Număr colectiv telex";
"06 03 55 04 16"	= "Identificator terminal Teletex";
"06 04 55 04 16 01"	= "Identificator colectiv terminal Teletex";
"06 03 55 04 17"	= "Număr de fax și telefon";
"06 04 55 04 17 01"	= "Număr colectiv fax și telefon";
"06 03 55 04 18"	= "Adresă X.121";
"06 03 55 04 19"	= "Număr internațional ISDN";
"06 04 55 04 19 01"	= "Număr colectiv internațional ISDN";
"06 03 55 04 1A"	= "Adresă înregistrată";
"06 03 55 04 1B"	= "Indicator destinație";
"06 03 55 04 1C"	= "Metodă preferabilă de livrare";
"06 03 55 04 1D"	= "Adresă prezentare";
"06 03 55 04 1E"	= "Context aplicații admis";
"06 03 55 04 1F"	= "Membru";
"06 03 55 04 20"	= "Proprietar";
"06 03 55 04 21"	= "Ocupant rol";
"06 03 55 04 22"	= "Vedeți de asemenea";
"06 03 55 04 23"	= "Parolă utilizator";
"06 03 55 04 24"	= "Certificat utilizator";
"06 03 55 04 25"	= "Certificat CA";
"06 03 55 04 26"	= "Listă de revocare a autorității";
"06 03 55 04 27"	= "Listă revocare certificat";
"06 03 55 04 28"	= "Asociere certificat contradictoriu";
"06 03 55 04 29"	= "Nume";
"06 03 55 04 2A"	= "Prenume";
"06 03 55 04 2B"	= "Inițiale";
"06 03 55 04 2C"	= "Calificator generare";
"06 03 55 04 2D"	= "Identificator unic";
"06 03 55 04 2E"	= "Calificator DN";
"06 03 55 04 2F"	= "Ghid căutare intensificat";
"06 03 55 04 30"	= "Informații protocol";
"06 03 55 04 31"	= "Nume diferențiat";
"06 03 55 04 32"	= "Membru unic";
"06 03 55 04 33"	= "Identificator casă";
"06 03 55 04 34"	= "Algoritmi admiși";
"06 03 55 04 35"	= "Listă de revocare Delta";
"06 03 55 04 36"	= "Aprobare";
"06 03 55 04 3A"	= "Asociere certificat contradictoriu";

/* X.500 object classes */

"06 02 55 06"		= "Clasă obiect X.520";
"06 03 55 06 00"	= "Sus";
"06 03 55 06 01"	= "Alias";
"06 03 55 06 02"	= "Țară";
"06 03 55 06 03"	= "Localitate";
"06 03 55 06 04"	= "Organizație";
"06 03 55 06 05"	= "Unitate organizatorică";
"06 03 55 06 06"	= "Persoană";
"06 03 55 06 07"	= "Persoană organizatorică";
"06 03 55 06 08"	= "Rol organizatoric";
"06 03 55 06 09"	= "Grup de nume";
"06 03 55 06 0A"	= "Persoană rezident";
"06 03 55 06 0B"	= "Proces aplicație";
"06 03 55 06 0C"	= "Entitate aplicație";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Dispozitiv";
"06 03 55 06 0F"	= "Utilizator cu autentificare puternică";
"06 03 55 06 10"	= "Autoritate certificat";
"06 03 55 06 11"	= "Grup de nume unice";
"06 03 55 06 15"	= "Utilizator PKI";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "Algoritmi X.500";
"06 03 55 08 01"	= "Algoritmi criptare X.500 ";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "Extensii certificat X.509";
"06 03 55 1D 01"	= "Identificator de cheie autoritate (vechi)";
"06 03 55 1D 02"	= "Atribute cheie primare (vechi)";
"06 03 55 1D 03"	= "Reguli certificat (vechi)";
"06 03 55 1D 04"	= "Restricție utilizare cheie (veche)";
"06 03 55 1D 05"	= "Structurare regulă (veche)";
"06 03 55 1D 06"	= "Constrângere subarbori";
"06 03 55 1D 07"	= "Nume alternativ subiect (vechi)";
"06 03 55 1D 08"	= "Nume alternativ al emitentului (vechi)";
"06 03 55 1D 09"	= "Atribute director subiect";
"06 03 55 1D 0A"	= "Constrângeri de bază (vechi 2.5.29.10)";
"06 03 55 1D 0B"	= "Constrângeri nume (vechi)";
"06 03 55 1D 0C"	= "Constrângeri regulă (vechi)";
"06 03 55 1D 0D"	= "Constrângeri de bază (vechi 2.5.29.13)";
"06 03 55 1D 0E"	= "Identificator cheie subiect";
"06 03 55 1D 0F"	= "Utilizare cheie";
"06 03 55 1D 10"	= "Perioadă de utilizare cheie privată";
"06 03 55 1D 11"	= "Nume alternativ subiect";
"06 03 55 1D 12"	= "Nume alternativ al emitentului";
"06 03 55 1D 13"	= "Constrângeri de bază";
"06 03 55 1D 14"	= "Număr listă revocare certificat";
"06 03 55 1D 15"	= "Cod motiv CRL";
"06 03 55 1D 16"	= "Data expirării (veche)";
"06 03 55 1D 17"	= "Reținere cod instrucție";
"06 03 55 1D 18"	= "Dată invaliditate";
"06 03 55 1D 19"	= "Puncte de distribuție CRL (vechi)";
"06 03 55 1D 1A"	= "Punct de distribuție emitere (vechi)";
"06 03 55 1D 1B"	= "Indicator Delta CRL";
"06 03 55 1D 1C"	= "Punct de distribuție emitere";
"06 03 55 1D 1D"	= "Emitent certificat";
"06 03 55 1D 1E"	= "Constrângeri nume";
"06 03 55 1D 1F"	= "Puncte de distribuție CRL";
"06 03 55 1D 20"	= "Reguli certificat";
"06 04 55 1D 20 00"	= "Orice identificator de regulă";
"06 03 55 1D 21"	= "Structurări regulă";
"06 03 55 1D 22"	= "Constrângeri regulă";
"06 03 55 1D 23"	= "Identificator de cheie autoritate";
"06 03 55 1D 24"	= "Constrângeri regulă";
"06 03 55 1D 25"	= "Utilizare extinsă a cheii";
"06 04 55 1D 25 00"	= "Orice utilizare extinsă a cheii";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "Algoritm semnătură SDNS";
"06 09 60 86 48 01 65 02 01 01 02"	= "Algoritm semnătură Fortezza";
"06 09 60 86 48 01 65 02 01 01 03"	= "Algoritm de confidențialitate SDNS";
"06 09 60 86 48 01 65 02 01 01 04"	= "Algoritm de confidențialitate Fortezza";
"06 09 60 86 48 01 65 02 01 01 05"	= "Algoritm de integritate SDNS";
"06 09 60 86 48 01 65 02 01 01 06"	= "Algoritm de integritate Fortezza";
"06 09 60 86 48 01 65 02 01 01 07"	= "Algoritm token de protecție SDNS";
"06 09 60 86 48 01 65 02 01 01 08"	= "Algoritm token de protecție Fortezza";
"06 09 60 86 48 01 65 02 01 01 09"	= "Algoritm de cheie management SDNS";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Algoritm de cheie management Fortezza";
"06 09 60 86 48 01 65 02 01 01 0B"	= "Algoritm de cheie management și semnătură SDNS";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Algoritm de cheie management și semnătură Fortezza";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Algoritm semnătură Suite A";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Algoritm de confidențialitate Suite A";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Algoritm de integritate Suite A";
"06 09 60 86 48 01 65 02 01 01 10"	= "Algoritm token de protecție Suite A";
"06 09 60 86 48 01 65 02 01 01 11"	= "Algoritm de cheie management Suite A";
"06 09 60 86 48 01 65 02 01 01 12"	= "Algoritm de cheie management și semnătură Suite A";
"06 09 60 86 48 01 65 02 01 01 13"	= "Algoritm semnătură actualizată Fortezza";
"06 09 60 86 48 01 65 02 01 01 14"	= "Algoritmi de cheie management și semnătură actualizată Fortezza";
"06 09 60 86 48 01 65 02 01 01 15"	= "Algoritm de integritate actualizat Fortezza";
"06 09 60 86 48 01 65 02 01 01 16"	= "Algoritm schimb cheie";
"06 09 60 86 48 01 65 02 01 01 17"	= "Algoritm Fortezza Wrap80";
"06 09 60 86 48 01 65 02 01 01 18"	= "Algoritm criptare cheie (ACC)";

"06 09 60 86 48 01 65 02 01 02 01"	= "Format mesaj RFC 822";
"06 09 60 86 48 01 65 02 01 02 02"	= "Conținut gol";
"06 09 60 86 48 01 65 02 01 02 03"	= "Tip conținut CSP";
"06 09 60 86 48 01 65 02 01 02 2A"	= "Tip conținut MSP Rev 3";
"06 09 60 86 48 01 65 02 01 02 30"	= "Tip conținut MSP";
"06 09 60 86 48 01 65 02 01 02 31"	= "Protocol agent reintroducere informații MSP";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "Tip conținut MSP Rev 3.1";
"06 09 60 86 48 01 65 02 01 02 48"	= "Parte a corpului mesaj MSP redirecționat";
"06 09 60 86 48 01 65 02 01 02 49"	= "Parametri mesaj redirecționat MSP";
"06 09 60 86 48 01 65 02 01 02 50"	= "Parte a corpului mesaj CSP redirecționat";
"06 09 60 86 48 01 65 02 01 02 51"	= "Parametri mesaj redirecționat CSP";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "Regulă de securitate SDNS";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Regulă de securitate";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Generic";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Regulă de securitate implicită";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "Certificat de cheie management SDNS";
"06 09 60 86 48 01 65 02 01 05 02"	= "Certificat semnătură utilizator SDNS";
"06 09 60 86 48 01 65 02 01 05 03"	= "Algoritm de cheie management și certificat semnătură SDNS";
"06 09 60 86 48 01 65 02 01 05 04"	= "Certificat de cheie management Fortezza";
"06 09 60 86 48 01 65 02 01 05 05"	= "Certificat de cheie management și semnătură Fortezza";
"06 09 60 86 48 01 65 02 01 05 06"	= "Certificat semnătură utilizator Fortezza";
"06 09 60 86 48 01 65 02 01 05 07"	= "Certificat semnătură Fortezza CA";
"06 09 60 86 48 01 65 02 01 05 08"	= "Certificat semnătură SDNS CA";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Vector auxiliar";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Regulă recepționare";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Calitate de membru";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Administratori";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "Meta SDNS semnătură CKL";
"06 09 60 86 48 01 65 02 01 05 2B"	= "SDNS semnătură CKL";
"06 09 60 86 48 01 65 02 01 05 2C"	= "Listă revocare certificat SDNS";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Listă revocare certificat Fortezza";
"06 09 60 86 48 01 65 02 01 05 2E"	= "CKL Fortezza";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Procesor adresă absolvit";
"06 09 60 86 48 01 65 02 01 05 30"	= "Gardă";
"06 09 60 86 48 01 65 02 01 05 31"	= "Algoritmi admiși";
"06 09 60 86 48 01 65 02 01 05 32"	= "Certificat de cheie management Suite A";
"06 09 60 86 48 01 65 02 01 05 33"	= "Algoritm de cheie management și certificat semnătură Suite A";
"06 09 60 86 48 01 65 02 01 05 34"	= "Certificat semnătură utilizator Suite A";
"06 09 60 86 48 01 65 02 01 05 35"	= "Informații PRBAC";
"06 09 60 86 48 01 65 02 01 05 36"	= "Constrângeri PRBAC CA";
"06 09 60 86 48 01 65 02 01 05 37"	= "Semnătură sau privilegii management cheie";
"06 09 60 86 48 01 65 02 01 05 38"	= "Privilegii comerciale";
"06 09 60 86 48 01 65 02 01 05 39"	= "Atribut etichetat";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Fișier informații regulă";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Fișier informații regulă de securitate";
"06 09 60 86 48 01 65 02 01 05 3C"	= "Constrângere aprobare CA";

"06 09 60 86 48 01 65 02 01 07 01"		= "Extensii CSP";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "Categorii de securitate ISSI";
"06 09 60 86 48 01 65 02 01 08 02"		= "Privilegii etichete de securitate standard";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Privilegii semnătură";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Privilegii management cheie";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Privilegiu de setare tag denumit";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK Demo";
"06 09 60 86 48 01 65 02 01 0B 02"			= "Departamentul Apărării al Statelor Unite Clasa 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "Pilot mediu Statele Unite";
"06 09 60 86 48 01 65 02 01 0B 04"			= "Departamentul Apărării al Statelor Unite Clasa 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "Departamentul Apărării al Statelor Unite Clasa 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "Departamentul Apărării al Statelor Unite Clasa 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "Departamentul Apărării al Statelor Unite Clasa 3 PKI";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Regulă de securitate test";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "Setare tag zero TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "Setare tag unu TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "Setare tag doi TSP1";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "Categorii de securitate TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "Setare tag zero TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "Setare tag unu TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "Setare tag doi TSP2";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Categorii de securitate Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Nume setare tag 1 Kafka ";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Nume setare tag 2 Kafka ";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Nume setare tag 3 Kafka ";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Introducere test CRL";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Etichetă";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "Identificator de regulă GAK";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "Identificator regulă rudimentară FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "Identificator regulă de bază FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "Identificator regulă medie FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "Identificator regulă superioară FBCA";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "Cheie KRA";
"06 08 60 86 48 01 65 03 02 03"			= "Extensii";
"06 09 60 86 48 01 65 03 02 03 01"		= "Tehnică de recuperare cheie";
"06 09 60 86 48 01 65 03 02 03 02"		= "Capabil de recuperare cheie";
"06 09 60 86 48 01 65 03 02 03 03"		= "Recuperare cheie";
"06 08 60 86 48 01 65 03 02 04"			= "Planuri de recuperare cheie";
"06 08 60 86 48 01 65 03 02 05"			= "Extensie CSOR GAK";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "Algoritm NIST";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Algoritm Novell";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "Taste DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "Taste DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "Taste DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "Taste RC5-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 cu criptare RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 cu criptare RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 cu criptare RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "Rezumat LM";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC cu SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC cu MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "Taste RC2-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "Pachet MD4";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "Criptare RSA BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "Parolă NW";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "Tip de atribut PKI";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Atribute securitate";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Limită încredere";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Identificator obiecte Netscape";
"06 08 60 86 48 01 86 F8 42 01"		= "Extensie certificat Netscape";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Tip certificat Netscape";
"06 09 60 86 48 01 86 F8 42 01 02"	= "URL bază Netscape";
"06 09 60 86 48 01 86 F8 42 01 03"	= "URL revocare Netscape";
"06 09 60 86 48 01 86 F8 42 01 04"	= "URL revocare Netscape CA";
"06 09 60 86 48 01 86 F8 42 01 05"	= "URL descărcare Netscape CRL";
"06 09 60 86 48 01 86 F8 42 01 06"	= "URL certificat descărcare Netscape CA";
"06 09 60 86 48 01 86 F8 42 01 07"	= "URL certificat reînnoire Netscape";
"06 09 60 86 48 01 86 F8 42 01 08"	= "URL regulă Netscape CA";
"06 09 60 86 48 01 86 F8 42 01 09"	= "URL certificat pagină principală Netscape";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Logo certificat entitate Netscape";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Certificat Netscape imagine utilizator ";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Nume server Netscape SSL";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Comentariu certificat Netscape";

"06 08 60 86 48 01 86 F8 42 02"		= "Tip de date Netscape";
"06 09 60 86 48 01 86 F8 42 02 01"	= "imagine/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "imagine/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "text/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Succesiune certificat Netscape";
"06 09 60 86 48 01 86 F8 42 02 06"	= "URL certificat Netscape";

"06 08 60 86 48 01 86 F8 42 03"			= "Identificator obiecte director Netscape";
"06 09 60 86 48 01 86 F8 42 03 01"		= "Definiții LDAP";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Înregistrare auto";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Număr departament";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Număr de angajat";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Tip de angajat";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Persoană organizatorică Intranet";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Crypto cu poartă server";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Extensie necunoscută Verisign VPN";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Extensie necunoscută Verisign VPN";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Identificator de regulă Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Notificare Verisign CPS v1";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "Tip conținut";
"06 04 67 2A 00 00"	= "Date PAN";
"06 04 67 2A 00 01"	= "Token PAN";
"06 04 67 2A 00 02"	= "Doar PAN";

"06 03 67 2A 01"	= "Extensie mesaj";
"06 03 67 2A 02"	= "Câmp";
"06 04 67 2A 02 00"	= "Nume întreg";
"06 04 67 2A 02 01"	= "Prenume";
"06 04 67 2A 02 02"	= "Nume de familie";
"06 04 67 2A 02 03"	= "Numele de familie la naștere";
"06 04 67 2A 02 04"	= "Nume loc";
"06 04 67 2A 02 05"	= "Număr identificare";
"06 04 67 2A 02 06"	= "Lună";
"06 04 67 2A 02 07"	= "Dată";
"06 04 67 2A 02 08"	= "Adresă";
"06 04 67 2A 02 09"	= "Telefon";
"06 04 67 2A 02 0A"	= "Sumă";
"06 04 67 2A 02 0B"	= "Număr de cont";
"06 04 67 2A 02 0C"	= "Frază-parolă";

"06 03 67 2A 03"		= "Atribut";
"06 04 67 2A 03 00"		= "Certificat";
"06 05 67 2A 03 00 00"	= "Amprentă cheie rădăcină";
"06 05 67 2A 03 00 01"	= "Regulă suplimentară";

"06 03 67 2A 04"	= "Algoritm";
"06 03 67 2A 05"	= "Regulă";
"06 04 67 2A 05 00"	= "Rădăcină";
"06 03 67 2A 06"	= "Modul";
"06 03 67 2A 07"	= "Extensie certificat";
"06 04 67 2A 07 00"	= "Cheie rădăcină Hash";
"06 04 67 2A 07 01"	= "Tip certificat";
"06 04 67 2A 07 02"	= "Date comerciant";
"06 04 67 2A 07 03"	= "Certificat de cartelă necesar";
"06 04 67 2A 07 04"	= "Tunneling";
"06 04 67 2A 07 05"	= "Extensii SET";
"06 04 67 2A 07 06"	= "Calificator SET";

"06 03 67 2A 08"	= "Brand";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Furnizor";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Încredințare";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Național";
"06 05 67 2A 0A E2 00"	= "Japonia";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Cheie rădăcină Hash";
"06 04 86 8D 6F 03"	= "Tip certificat";
"06 04 86 8D 6F 04"	= "Date comerciant";
"06 04 86 8D 6F 05"	= "Certificat de cartelă necesar";
"06 04 86 8D 6F 06"	= "Tunneling";
"06 04 86 8D 6F 07"	= "Calificator SET";
"06 04 86 8D 6F 63"	= "Date SET";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Date de securitate Apple";

"06 08 2A 86 48 86 F7 63 64 01" = "Identificator regulă de încredere Apple";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Regulă Apple iSign";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Regulă de bază Apple X.509";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Regulă Apple SSL";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Regulă de generare certificat local Apple";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Regulă de generare CSR local Apple";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Regulă de revocare Apple CRL";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Regulă de revocare Apple OCSP";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Regulă Apple S/MIME";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Regulă de autentificare extensibilă Apple";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Regulă de semnare actualizare de software Apple";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Regulă Apple IPsec";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Regulă Apple iChat";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Regulă semnare resursă Apple";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Regulă client Apple Kerberos";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Regulă server Apple Kerberos";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Regulă semnare cod Apple";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Regulă semnare pachet Apple";

"06 08 2A 86 48 86 F7 63 64 02" = "Identificator de algoritm de securitate Apple";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "Criptare eliptică rapidă (CER)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Comprimare securizată Apple (CSA)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE cu semnătură MD5";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE cu semnătură SHA-1";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Criptare Apple FEED";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED (experimental)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE cu semnătură ECDSA";

"06 08 2A 86 48 86 F7 63 64 03" = "Identificator certificat Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Solicitare certificat Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Solicitare certificat de identitate Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Solicitare certificat de semnare e-mail Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Solicitare certificat de criptare e-mail Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Solicitare listă din arhiva Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Solicitare stocare arhivă în Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Solicitare aducere din arhiva Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Solicitare eliminare arhivă din Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Extensie certificat Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Identitate Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Semnare e-mail Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Criptare e-mail Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Valoare solicitare certificat Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Nume utilizator";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Parolă";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Nume de gazdă";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Reînnoire marcare";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Marcator asincron";

"06 08 2A 86 48 86 F7 63 64 04" = "Utilizare extinsă a cheii Apple";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Semnare cod Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Semnare cod Apple (dezvoltare)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Semnare actualizare de software Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Semnare cod Apple (rezervat)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Semnare resursă Apple";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Semnare Apple iChat";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Criptare Apple iChat";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Identitate sistem Apple";

"06 08 2A 86 48 86 F7 63 64 05" = "Reguli certificat Apple";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Regulă certificat Apple";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Regulă certificat Apple .Mac";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Semnare cod";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Securitate Intel CDSA";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Formaturi de securitate Intel CDSA";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "Extensii certificat X.509v3";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "Extensii certificat private X.509v3";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Bitmap semnătură subiect";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Poză subiect";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "Adresă e-mail subiect";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Utilizare scutiri";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Algoritmi de securitate Intel CDSA";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 cu ECDSA";

/* end */
